artillery/product_id/product-multiple(2)-10.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up
    - duration: 120
      arrivalRate: 10
      name: Sustained load
  payload:
    path: "simple-random-product-test.csv"
    fields:
      - "product_id1"
      - "product_id2"
      - "product_id3"
      - "product_id4"

scenarios:
  - name: "Browse products"
    flow:
      - get:
          url: "/qa/questions?product_id={{ product_id1 }}"
      - think: 15
      - get:
          url: "/qa/questions?product_id={{ product_id2 }}"