artillery/product_id/product-multiple(2)-500.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 50
      name: Warm up
    - duration: 120
      arrivalRate: 50
      rampTo: 500
      name: Ramp up
    - duration: 120
      arrivalRate: 500
      name: Sustained load
  payload:
    path: "simple-random-product-test.csv"
    fields:
      - "product_id1"
      - "product_id2"
      - "product_id3"
      - "product_id4"

scenarios:
  - name: "Browse products"
    flow:
      - get:
          url: "/qa/questions?product_id={{ product_id3 }}"
      - think: 15
      - get:
          url: "/qa/questions?product_id={{ product_id4 }}"